const Map<String, List<String>> INTEREST = {
  "MBTI" : [
    "\u{1F408}infp", "\u{1F433}enfp", "\u{1F428}isfp", "\u{1F43C}infj", "\u{1F989}intp", "\u{1F98F}isfj", "\u{1F415}enfj", "\u{1F40D}istp", "\u{1F98A}esfp",
    "\u{1F99C}entp", "\u{1F418}esfj", "\u{1F405}intj", "\u{1F422}istj", "\u{1F981}entj", "\u{1F406}estp", "\u{1F43A}estj"
  ],
  "성격" : [
    "\u{1F60A}내향적", "\u{1F604}외향적", "\u{1F914}이성적", "\u{1F970}감성적", "\u{1F606}낙천적"
  ],
  "관심사" : [
    "\u{1F9F3}여행", "\u{1F524}외국어", "\u{1F373}요리", "\u{1F4D5}독서", "\u{1F697}드라이브", "\u{1F6D2}쇼핑", "\u{1F950}베이킹",
    "\u{1F3BC}음악", "\u{1F4F8}사진", "\u{1F456}패션", "\u{1F3A8}그림", "\u{1F484}메이크업", "\u{2728}뷰티", "\u{1F5BC}전시회",
    "\u{1F58C}디자인", "\u{1F4F7}카메라", "\u{1F3E1}인테리어"
  ],
  "엔터테인먼트" : [
    "\u{1F39E}영화감상", "\u{1F37F}넷플릭스", "\u{1F31F}kpop", "\u{1F9F8}애니메이션", "\u{1F579}게임", "\u{1F4F9}유튜브",
    "\u{1F495}인스타그램", "\u{1F979}드라마", "\u{1F5E8}웹툰", "\u{1F372}지브리", "\u{1F3A4}코인노래방", "\u{1F451}디즈니",
    "\u{1F3BB}악기연주", "\u{1F354}먹방", "\u{1FA84}해리포터", "\u{1F9B8}마블", "\u{1F5E1}롤", "\u{1F3A7}피시방", "\u{1F3AE}닌텐도", "\u{1FA96}pubg"
  ],
  "스포츠" : [
    "\u{1F3CB}헬스", "\u{1F483}댄스", "\u{1F3C0}농구", "\u{26BE}야구", "\u{26BD}축구", "\u{1F3C3}러닝", "\u{1F3D0}배구",
    "\u{1F3CA}수영", "\u{1F6B4}자전거", "\u{1F3B3}볼링", "\u{26F0}등산", "\u{1F938}필라테스", "\u{1F9D8}요가",
    "\u{1F94B}주짓수", "\u{1F3C4}서핑"
  ],
  "커리어" : [
    "\u{1F310}언어", "\u{1F58C}디자인", "\u{1F3EB}교육", "\u{1F4D1}취준", "\u{1F4BB}IT", "\u{1F4B0}아르바이트", "\u{1F9D1}프로그래밍",
    "\u{1F5D3}이직", "\u{1F4CA}마케팅", "\u{1F4A1}스타트업", "\u{1F393}인턴", "\u{1F91D}HR"
  ]
};

const Map<String, List<String>> emptyInterest =
{
  "MBTI" : [],
  "성격" : [],
  "관심사" : [],
  "엔터테인먼트" : [],
  "스포츠" : [],
  "커리어" : []
};

const Map<String, int> maxSelectCountOfInterest = {
  "MBTI" : 1,
  "성격" : 1,
  "관심사" : 10,
  "엔터테인먼트" : 10,
  "스포츠" : 10,
  "커리어" : 10,
};

const Map<String, int> minSelectCountOfInterest = {
  "MBTI" : 1,
  "성격" : 1,
  "관심사" : 3,
  "엔터테인먼트" : 3,
  "스포츠" : 3,
  "커리어" : 2,
};
