const INTEREST = {
  "MBTI" : [
    "infp", "enfp", "isfp", "infj", "intp", "isfj", "enfj", "istp", "esfp",
    "entp", "esfj", "intj", "istj", "entj", "estp", "estj"
  ],
  "성격" : [
    "내향적", "외향적", "이성적", "감성적", "낙천적"
  ],
  "관심사" : [
    "여행", "외국어", "요리", "독서", "드라이브", "쇼핑", "베이킹",
    "음악", "사진", "패션", "그림", "메이크업", "뷰티", "전시회",
    "디자인", "카메라", "인테리어"
  ],
  "엔터테인먼트" : [
    "영화감상", "넷플릭스", "kpop", "애니메이션", "게임", "유튜브",
    "인스타그램", "드라마", "웹툰", "지브리", "코인노래방", "디즈니",
    "악기연주", "먹방", "해리포터", "마블", "롤", "피시방", "닌텐도", "pubg"
  ],
  "스포츠" : [
    "헬스", "댄스", "농구", "야구", "축구", "러닝", "배구",
    "수영", "자전거", "볼링", "등산", "필라테스", "요가",
    "주짓수", "서핑"
  ],
  "커리어" : [
    "언어", "디자인", "교육", "취준", "IT", "아르바이트", "프로그래밍",
    "이직", "마케팅", "스타트업", "인턴", "HR"
  ]
};
